app/Http/Controllers/HomeController.php

    public function updateProfile(Request $request) {
        $validator = Validator::make($request->all(), [
            'password' => 'required|string|max:255'
        ]);

        if ($validator->fails()) {
            return redirect()->route('home')->withErrors($validator)->withInput();
        }

        $user = User::find(Auth::user()->id);
        $user->password = bcrypt($request->input('password'));

        if($user->save()) {
---
update `users` set `password` = '$2y$10$jyww4vql/EIcoo8.3sZ0rOMYD8VeRNZO3HtcNP96RoJPnFi8UeKNq', `users`.`updated_at` = '2023-05-05 10:46:52' where `id` = 1

    public function getAllUser() {
        $users = User::all();
---
select * from `users`