app/Http/Controllers/HomeController.php

    public function index()
    {
        // one - one
        $user = TrainingUser::find(1);
---
select * from `users` where `users`.`id` = 1 limit 1

    private function getAllPost() {
        return TrainingPost::all();
---
select * from `training_posts`

    public function relationshipExists() {
        // lấy ra những user có post
        $users = TrainingUser::has('posts')->get();

        // lấy ra những user thuộc user id = 1 từ post
        $users = TrainingUser::whereHas('posts', function ($query) {
            $query->where('post_user_id', 1);
        })->get();

        // lấy ra những user thuộc category id = 4 hoặc có giá trị 'post 2' từ post
        $post2 = 'post 2';

        $users = TrainingUser::whereHas('posts', function ($query) use ($post2)  {
            $post_tmp = $post2;
            $query->whereHas('categories', function ($query2) use ($post_tmp) {
                $query2->where('training_categories_posts.category_id', 4)
                    ->orWhere('training_categories_posts.value_tmp', $post_tmp);
            });
        })->get();

        // lấy ra những user thuộc user id = 1 từ post
        $users = TrainingUser::whereRelation('posts', 'post_user_id', 1)->get();
---
select * from `training_users` where `training_users`.`user_id` in (1, 2, 3)
select * from `training_users` where exists (select * from `training_posts` where `training_users`.`user_id` = `training_posts`.`post_user_id` and `post_user_id` = 1)
select * from `training_users` where exists (select * from `training_posts` where `training_users`.`user_id` = `training_posts`.`post_user_id` and exists (select * from `training_categories` inner join `training_categories_posts` on `training_categories`.`category_id` = `training_categories_posts`.`category_id` where `training_posts`.`post_id` = `training_categories_posts`.`post_id` and (`training_categories_posts`.`category_id` = 4 or `training_categories_posts`.`value_tmp` = 'post 2')))